Repository: rajajhansi/MenYappu
Catalog: Tamil.Grammar.Prosody.Infrastructure/Resources/ProsodyResources.*.resx
Languages: ta

source: About MenYappu
ta: மென்யாப்பைப் பற்றி

source: Download
ta: பதிவிறக்கம்

source: Feedback
ta: கருத்து

source: Games
ta: விளையாட்டுகள்

source: Help
ta: உதவி

source: Home
ta: முகப்பு

source: Letter Type Finder
ta: எழுத்து வகைபிரி

source: Linkage Finder
ta: தளை தட்டாதே

source: Mathirai Calculator
ta: மாத்திரை எவ்வளவு?

source: MenYappu
ta: மென்யாப்பு

source: Metrical Foot Finder
ta: சீர் செய்

source: Metrical Line Measurer
ta: அடி அளவிடு

# OrnamentationFinder
source: Oranamentation Finder
ta: தொடை தொடு

source: Rhyme/Alliteration Finder
ta: எதுகை மோனை எழுது

source: Settings
ta: அமைப்புகள்

source: Syllable Divider
ta: அசை பிரி

source: Venpaas
ta: வெண்பாக்கள்

source: Venpaa Conversations
ta: வெண்பா உரையாடல்கள்

# WriteAPaa
source: Paa Writer
ta: பாவெழுது

source: Alliteration
ta: மோனை

source: Check Answer
ta: சரி பார்த்திடுக

source: Clear
ta: நீக்குக

source: Compare with Venpaa rules
ta: வெண்பா விதிகளோடு ஒப்பிடுக

source: Count
ta: எண்ணிக்கை

# DoNotParseShortUBeforeInitialVowels
source: Do not parse initial vowels or short-i before short-u
ta: குற்றியலுகரத்தின் முன் உயிரெழுத்தை (அ) குற்றியலிகரத்தை அலகிடாது விடுக

source: Eliminate Vilaankaay Metrical Feet
ta: விளாங்காய்ச்சீர்களை விலக்குக

source: End Rhyme
ta: இயைபு

# HowToSeeTheResult
source: After you enter the answer(s), click on "Check Answer" button to see the "Result".
ta: நீங்கள் விடையை உள்ளிட்டவுடன் “சரி பார்த்திடு” என்ற பொத்தானை அழுத்தினால் “முடிவு” தெரியும்.

# InputTheVerse
source: Input Verse
ta: செய்யுளை உள்ளிடவும்

source: Input Word
ta: சொல்லை உள்ளிடவும்

source: Letter
ta: எழுத்து

# LetterTypeFinderInfoTip
source: Either enter only one word (or) click on "Sample" button below.
ta: ஒரேயொரு சொல்லை மட்டும் உள்ளிடவும் (அ) கீழேயுள்ள “மாதிரி” பொத்தானை அழுத்தவும்.

source: Letter Types
ta: எழுத்து வகைகள்

source: Linkage
ta: தளை

# MetremeAndMetricalFeet
source: Metreme & Metrical Feet
ta: அசை-சீர்

source: Metrical Line
ta: அடி

source: Parse
ta: பகுத்திடுக

source: Parsed Results
ta: பகுத்தல் முடிவுகள்

source: Result
ta: முடிவு

source: Rhyme
ta: எதுகை

source: Sample
ta: மாதிரி

# SelectALetterType
source: Select Letter Type
ta: எழுத்து வகையைத் தேர்ந்தெடு

# VenpaaRulesComparison
source: Venpaa Ruels Comparison
ta: விதி ஒப்பீடு

source: Word
ta: சொல்

# AboutMenYappuDetails
source: MenYappu is a website that has all the services essential for poem writers like prosody games, poem composer and poem analyzer integrated and presented in a very simple, intuitive user interface. Since the services are also exposed as web services, mobile phone users can write an app in their preferred platforms like Apple IOS, Android or Windows Mobile usiing these web services and consume them.
ta: மென் யாப்பு என்பது செய்யுள் படிக்க படைக்க விரும்பும் தமிழார்வலர்களுக்கு எளிய வகையில் யாப்பிலக்கண விளையாட்டுகள், பா இயற்றி, பா ஆராய்ச்சி சேவைகளை ஒருங்கிணைத்துத் தரும் ஒரு தளமாகும். இந்தத் தளத்தின் சேவைகள் வெப் சர்வீஸாகவும் அளிக்கப்படுவதால் ஆப்பிள், ஆண்ட்ராய்டு, விண்டோஸ் அலைபேசிப் பயனர்கள் அந்த வெப் சர்வீஸ்களைப் பயன்படுத்தி அவர்களே செயலிகளை உருவாக்கிக் கொள்ள முடியும்.

source: Asiriyappaa
ta: ஆசிரியப்பா

source: Asiriyappaavinam
ta: ஆசிரியப்பாவினம்

source: Audio
ta: ஒலி

# BogdanUrs
source: Mr. Bogdan Urs
ta: திரு. போக்டான் உர்ஸ்

source: Click this button for help
ta: உதவிக்கு இந்தப் பொத்தானை அழுத்தவும்.

source: Close
ta: மூடுக

source: Correct Duration Count
ta: சரியான மாத்திரை எண்ணிக்கை

source: Design
ta: வடிவமைப்பு

source: Duration Count
ta: மாத்திரை எண்ணிக்கை

# EnterDurationCountAndCheckResult
source: Enter the Duration Count and click on "Check Answer" button to see the "Result".
ta: மாத்திரை எண்ணிக்கையை உள்ளிடவும். பிறகு “சரி பார்த்திடு” பொத்தானை அழுத்தவும்.

source: Executor
ta: செய்தவர்

# InspirationAndMotivation
source: Inspiration/Motivation
ta: உந்துதல்/தூண்டுகோல்

source: Kalippaa
ta: கலிப்பா

source: Kalippaavinam
ta: கலிப்பாவினம்

# KandasamyPalanisamy
source: Mr. Kandasamy Palanisamy
ta: திரு. கந்தசாமி பழனிச்சாமி

# MathiraiCalculatorInfoTip
source: Enter only one word (or) sentence (or) click on "Sample" button below.
ta: ஒரெயொரு சொல்லை (அ) வாக்கியத்தை உள்ளிடவும் (அ) கீழேயுள்ள “மாதிரி” பொத்தானை அழுத்தவும்.

source: Metreme
ta: அசை

source: MetricalFeet
ta: சீர்

source: Ornamentation
ta: தொடை

source: Paa Categories
ta: பாவினங்கள்

source: Paa Types
ta: பா வகைகள்

source: Prosody
ta: யாப்பிலக்கணம்

# RajaMani
source: Mr. Raja Mani
ta: திரு. ராஜா மணி

source: Search
ta: தேடு

source: Software Development
ta: மென்பொருள் உருவாக்கம்

source: Sound
ta: ஓசை

# SuggestionAndReview
source: Suggestion/Review
ta: ஆலோசனை

source: Task
ta: பணி

source: Vanjippaa
ta: வஞ்சிப்பா

source: Vanjippaavinam
ta: வஞ்சிப்பாவினம்

source: Venpaa
ta: வெண்பா

source: Venpaavinam
ta: வெண்பாவினம்

source: Video
ta: நிகழ்படம்

# VinodRajan
source: Mr. Vinod Rajan
ta: திரு. வினோத் ராஜன்

source: Word (or) Sentence
ta: சொல் (அ) வாக்கியம்

# PaaSound
source: Paa's Sound
ta: ஓசை வரும் பா

# SelectAPaaWithSound
source: Select a Paa with Selected Sound
ta: ஓசை வரும் பாவைத் தேர்ந்தெடு

# SelectASound
source: Select Sound Type
ta: ஓசை வகையைத் தேர்ந்தெடு

source: Select a Sound Definition
ta: ஓசை விளக்கத்தைத் தேர்ந்தெடு

source: Sound Definition
ta: ஓசை விளக்கம்

# SoundMatcher
source: Sound of Paa
ta: பாவின் ஓசை

# SoundMatcherInfoTip
source: After selecting a sound, choose the correct definition, paa with that sound and click on "Check Answer" button to see the "Result".
ta: ஒரு ஓசை வகையைத் தேர்ந்தெடுத்த பின் அதற்கான சரியான விளக்கத்தையும் அந்த ஓசை வரும் பாவையும் தேர்ந்தெடுத்த பின் “சரி பார்த்திடு” என்ற பொத்தானை அழுத்தினால் “முடிவு” தெரியும்.

source: Sound Types
ta: ஓசை வகைகள்

source: Additional Information
ta: மேலதிகத் தகவல்கள்

source: Collapse All
ta: எல்லாவற்றையும் சுருக்கு

source: Coming soon...
ta: கூடிய விரைவில்...

source: Expand All
ta: எல்லாவற்றையும் விரிவாக்கு

source: FAQ
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

source: Quiz
ta: வினாடி வினா

source: Finish
ta: முடித்திடுக

source: Next
ta: பின்

# Previous
source: Prev
ta: முன்

source: Introduction
ta: அறிமுகம்

# QuizInfoTip
source: Please answer all questions and then click the "Finish" button to see your score.
ta: தயவு செய்து எல்லாக் கேள்விகளுக்கும் விடையளித்த பின்பு “முடி” என்ற பொத்தானை அழுத்தினால் நீங்கள் பெற்ற புள்ளிகள் எவ்வளவு என்பது தெரியும்.

# Score
source: Your score is: {1}/{2}
ta: நீங்கள் பெற்ற புள்ளிகள்: {1}/{2}

source: Parts of Speech
ta: பேச்சின் உறுப்புகள்

source: Sol Ilakkanam
ta: சொல் இலக்கணம்

source: Vetrumai Urubugal
ta: வேற்றுமை உருபுகள்

source: Contact
ta: தொடர்பு

# ContributeToMenyappu
source: Ready to contribute content to MenYappu? That's great! Send us an email and we will get back to you as soon as possible!
ta: இந்த வலைத்தளத்திற்குப் பங்களிக்க விடயமிருக்கிறதா? அருமை! எங்களுக்கு மின் மடல் அனுப்பினால் நாங்கள் விரைவில் உங்களைத் தொடர்பு கொள்ளுவோம்.

source: Find out more
ta: மேலும் விபரங்கள் அறிய

# GameForKidsAndAdults
source: Games for Kids and Adults
ta: மாணவர்களுக்கும் பெரியவர்களுக்குமான விளையாட்டுகள்

# GamesForKidsAndAdultsDescription
source: Grammar games are designed with a goal to incrementally learn and advance to the next level in Tamil grammar.
ta: இலக்கண விளையாட்டுகள் படிப்படியாகக் கற்று உயர்நிலையை எட்டும் வகையில் அமைக்கப்பட்டுள்ளது.

# ImproveKnowledge
source: Find out cool stuff about the longest surviving classical language in the world and boost your knowledge!
ta: உலகின் மிகத் தொன்மையான செம்மொழியான தமிழ் மொழியின் வியத்தகும் விடயங்களைப் பற்றி அறிந்து கொண்டு உங்கள் அறிவுத்திறனை மேம்படுத்துக!

source: Let's Get In Touch!
ta: தொடர்பு கொள்ளுங்கள்

# MadewithLoveAndPassion
source: Made with Love and Passion for Tamil
ta: தமிழின் மேலுள்ள தணியாத ஆர்வத்தால் அமைக்கப்பட்டது

# MadewithLoveAndPassionDescription
source: We made this learning portal with love and passion for our language "Tamil"
ta: இந்தத் தமிழ் இலக்கண வலைத்தளம் தமிழின் மேலுள்ள தணியாத ஆர்வத்தால் எங்களால் அமைக்கப்பட்டது.

# MenyappuAnEffort
source: MenYappu, an effort to make learning Tamil grammar interesting and intuitive!
ta: மென்யாப்பு, இது தமிழ் இலக்கணத்தை ஆர்வமாகவும் புரியும் வகையிலும் கற்றுக்கொடுக்கும் ஒரு முயற்சி!

# MenyappuHasAll
source: MenYappu has everything you need to get your foundation in Tamil grammar in a short time! All of the games, audio and video instructions on Tamil grammar are open source, free to download, and easy to use. No strings attached!
ta: குறுகிய காலத்தில் தமிழ் இலக்கணத்தில் நல்ல அடிப்படைத் திறன் பெறத்தேவையான் அனைத்தும் மென்யாப்பு-வில் இருக்கிறது! இங்குள்ள எல்லா விளையாட்டுகளும், ஒலிப்பதிவுகளும், நிகழ் படங்களும் கட்டற்ற அமைப்பிலும், இலவசமாகத் தரவிறக்கம் செய்யும் வகையிலும், சுலபமாகப் பயன்படுத்தும் வகையிலும் அமைக்கப்பட்டிருக்கிறது. வேறு எந்த நோக்கமும் இல்லை!

source: Services in MenYappu
ta: மென்யாப்பு வழங்கும் சேவைகள்

source: Start learning!
ta: கற்றலைத் தொடங்குக!

# UnderstandingPoems
source: Understand Poems
ta: பாக்களைப் புரிந்து கொள்ள

# UnderstandingPoemsDescription
source: Understanding grammar helps Tamils to understand and appreciate Tamil literature!
ta: தமிழ் இலக்கணத்தைப் புரிந்து கொள்வது தமிழ் இலக்கியங்களைப் புரிந்து ரசிக்க உதவுகிறது!

source: Up to Date
ta: இன்று வரை

# UptoDateDescription
source: We update the content of this portal whenever we see a new way of providing an interactive tutorial.
ta: நாங்கள் இத்தளத்தில் உள்ள விடயங்களை அவ்வப்போது புதுமையாக மாற்றியமைத்துக் கொண்டே இருக்கிறோம். நன்றாகப் புரியும் வகையில் கற்பிக்கும் புது உத்திகளைக் கண்டால் உடனே அவற்றை இங்கே செயல்படுத்துகிறோம்.

# WeGotWhatYouNeed
source: We've got what you need!
ta: உங்களுக்குத் தேவையான விடயங்கள் இங்கிருக்கின்றன!

# YourFavoriteTamilPortal
source: Your favorite Tamil grammar learning portal!
ta: உங்களுக்குப் பிடித்தமான தமிழ் இலக்கணம் கற்கும் வலைத்தளம்

source: Input only one Metrical Foot
ta: ஒரேயொரு சீரை உள்ளிடவும்

source: Metreme Type
ta: அசை வகை

source: Metreme Types
ta: அசை வகைகள்

# MetricalFootInfoTip
source: Split the metremes using ‘/’ symbol. For e.g., you can syllable the word "மனிதம்" like ”மனி” / “தம்”.
ta: சீர் (அ) சொல்லிலுள்ள அசைகளை ‘/’ என்ற குறியீடால் பிரிக்கவும். எ.கா. மனி/தம். இந்தச் சொல்லை ”மனி” / “தம்” என்று அசை பிரிக்கலாம்.

# SelectAMetremeType
source: Select a Mereme Type
ta: அசை வகையைத் தேர்ந்தெடு

source: Alliteration Type
ta: மோனை வகை

source: Alliteration word
ta: மோனைச் சொல்

source: Count of Metrical Lines
ta: அடிகள் எண்ணிக்கை

source: End Rhyme Type
ta: இயைபு வகை

source: End Rhyme word
ta: இயைபுச் சொல்

source: First word
ta: முதலாவது சொல்

# InputMetricalLine
source: Input Metrical Line (requires atleast 2 Metrical Feet)
ta: அடியை உள்ளிடவும் (குறைந்தது 1 சீர் அவசியம்)

# InputSentence
source: Input a sentece (requires at least 2 Metrical Feet)
ta: வாக்கியத்தை உள்ளிடவும் (குறைந்தது 2 சீர்கள் அவசியம்)

source: Linkage Type
ta: தளை வகை

# LinkageTypeInfoTip
source: Input only 2 Metrical Feet (or) click on "Sample" button below.
ta: இரு சீர்களை மட்டும் உள்ளிடவும் (அ) கீழேயுள்ள “மாதிரி” பொத்தானை அழுத்தவும்.

source: Linkage Types
ta: தளை வகைகள்

source: Metrical Foot Type
ta: சீர் வகை

source: Metrical Foot Types
ta: சீர் வகைகள்

# MetricalLineInfoTip
source: Input Metrical Line (requires atleast 1 Metrical Foot in that Metrical Line)
ta: ஒரு அடியை உள்ளிடவும். அந்த அடியில் குறைந்தது ஒரு சீராவது உள்ளிடவும்.

source: Metrical Lines
ta: அடிகள்

source: Metrical Line Type
ta: அடி வகை

source: Metrical Line Types
ta: அடி வகைகள்

# OrnamentationInfoTip
source: Input at least 1 Metrical Line (requires atleast 2 Metrical Feet in that Metrical Line)
ta: குறைந்தது ஒரு அடியை உள்ளிடவும். அந்த அடியில் குறைந்தது இரு சீர்களை உள்ளிடவும்.

source: Ornamentation Type
ta: தொடை வகை

source: Ornamentation Types
ta: தொடை வகைகள்

source: Rhyme Type
ta: எதுகை வகை

source: Rhyme word
ta: எதுகைச் சொல்

source: Second word
ta: இரண்டாவது சொல்

source: Select a Linkage Type
ta: தளை வகையைத் தேர்ந்தெடு

source: Select a Metrical Foot Type
ta: சீர் வகையைத் தேர்ந்தெடு

source: Select a Metrical Line Type
ta: அடி வகையைத் தேர்ந்தெடு

source: Select an Alliteration Type
ta: மோனை வகையைத் தேர்ந்தெடு

source: Select an End Rhyme Type
ta: இயைபு வகையைத் தேர்ந்தெடு

source: Select a Rhyme Type
ta: எதுகை வகையைத் தேர்ந்தெடு

source: Sentence
ta: வாக்கியம்

source: Words
ta: சொற்கள்

source: Videos
ta: நிகழ்படங்கள்

# VideosInfo
source: We have provided tutorial as well as simple research paper presentation videos that will easily teach you Tamil grammar in this site.
ta: நாங்கள் தமிழ் இலக்கணத்தைக் கற்பிக்கும் எளிமையான நிகழ்படங்களையும் ஆராய்ச்சிக் கட்டுரை வழங்கல் நிகழ்படங்களையும் இத்தளத்தில் கொடுத்துள்ளோம்.

source: Address
ta: முகவரி

# AddressDetail
source: 5675 Kimberly St., San Jose, CA 95129
ta: 5675 கிம்பர்லி தெரு, சான் ஹோஸே, கலிஃபோர்னியா 95129

source: Game
ta: விளையாட்டு

# PlayThisGame
source: To make sure that you have understood the concepts of this part of prosody, why don't you play the game and the quiz related to this prosody part?
ta: இந்த உறுப்பினை நன்றாகப் புரிந்து கொண்டுள்ளீர்களா எனத் தெரிந்து கொள்ள இதற்குத் தொடர்புடைய விளையாட்டையும் அந்தப் பக்கத்தில் இருக்கும் வினாடி வினாவையும் விளையாண்டு பார்த்தால் என்ன?
