using System.Collections.Generic;

namespace RjamSoft.Tamil.Grammar.Parser
{
    public class TamilLanguageConstants
    {
        public static string Vowel = "உயிரெழுத்துகள்";
        public static string Consonant = "மெய்யெழுத்துகள்";
        public static string ConsonantVowel = "உயிர்மெய்யெழுத்துகள்";
        public static string Aytham = "ஆய்த எழுத்து";
        public static string Kuril = "குறில் எழுத்துக்கள்";
        public static string Nedil = "நெடில் எழுத்துக்கள்";

        public static Dictionary<char, char> UyirEzuthukkalAgarathi = new Dictionary<char, char>
        {
                                                    {'அ', 'அ'},
                                                    {'ஆ', 'ஆ'},
                                                    {'இ', 'இ'},
                                                    {'ஈ', 'ஈ'},
                                                    {'உ', 'உ'},
                                                    {'ஊ', 'ஊ'},
                                                    {'எ', 'எ'},
                                                    {'ஏ', 'ஏ'},
                                                    {'ஐ', 'ஐ'},
                                                    {'ஒ', 'ஒ'},
                                                    {'ஓ', 'ஓ'},
                                                    {'ஔ', 'ஔ'}
        };

        public static Dictionary<char, string> UyirEzuthukkal2LatinAgarathi = new Dictionary<char, string>
        {
                                                    {'அ', "_அ"},
                                                    {'ஆ', "_ஆ"},
                                                    {'இ', "_இ"},
                                                    {'ஈ', "_ஈ"},
                                                    {'உ', "_உ"},
                                                    {'ஊ', "_ஊ"},
                                                    {'எ', "_எ"},
                                                    {'ஏ', "_ஏ"},
                                                    {'ஐ', "_ஐ"},
                                                    {'ஒ', "_ஒ"},
                                                    {'ஓ', "_ஓ"},
                                                    {'ஔ', "_ஔ"},
													{'க', "க"},
                                                    {'ங', "ங"},
                                                    {'ச', "ச"},
                                                    {'ஞ', "ஞ"},
                                                    {'ட', "ட"},
                                                    {'ண', "ண"},
                                                    {'த', "த"},
                                                    {'ந', "ந"},
                                                    {'ப', "ப"},
                                                    {'ம', "ம"},
                                                    {'ய', "ய"},
                                                    {'ர', "ர"},
                                                    {'ல', "ல"},
                                                    {'வ', "வ"},
                                                    {'ழ', "ழ"},
                                                    {'ள', "ள"},
                                                    {'ற', "ற"},
                                                    {'ன', "ன"},
                                                    { 'ஜ', "ஜ" },
                                                    { 'ஶ', "ஶ" },
                                                    { 'ஷ', "ஷ" },
                                                    { 'ஸ', "ஸ" },
                                                    { 'ஹ', "ஹ" },
                                                     {'ா', "A"}, // 0x0BBE - 'ா', ஆகார உயிர் மெய்யெழுத்தில் வரும் துணைக்கால் - கா
                                                    {'ி', "i"}, // 0x0BBF - 'ி', இகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கி
                                                    {'ீ', "I"}, // 0x0BC0 - 'ீ', ஈகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கீ
                                                    {'ு', "u"}, // 0x0BC1 - 'ு', உகார உயிர் மெய்யெழுத்தில் வரும் கீழே வரும் கோடு - பு
                                                    {'ூ', "U"}, // 0x0BC2 - 'ூ', ஊகார உயிர் மெய்யெழுத்தில் வரும் வளைந்த கொக்கி - பூ
                                                    {'ெ', "e"}, // 0x0BC6 - 'ெ', எகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கெ
                                                    {'ே', "E"}, // 0x0BC7 - 'ே', ஏகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கே
                                                    {'ை', "Y"}, // 0x0BC8 - 'ை' ஐகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கை
                                                    {'ொ', "o"}, // 0x0BCA - 'ொ', ஒகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கொ
                                                    {'ோ', "O"}, // 0x0BCB - 'ோ', ஓகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கோ
                                                    {'ௌ', "W"}, // 0x0BCC - 'ௌ', ஒளகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்புகள் - கெள
                                                    {'்', "்"}, // 0x0BCD - '்', ஒற்று எழுத்தில் தலையில் வரும் புள்ளி - க்
                                                     {'ஃ', "_ஃ"} // 0X0B83 - 'ஃ', ஆய்த எழுத்து
                                                    /*
                                                    {'ா', "ஆ"},
                                                    {'ி', "இ"},
                                                    {'ீ', "ஈ"},
                                                    {'ு', "உ"},
                                                    {'ூ', "ஊ"},
                                                    {'ெ', "எ"},
                                                    {'ே', "ஏ"},
                                                    {'ை', "ஐ"},
                                                    {'ொ', "ஒ"},
                                                    {'ோ', "ஓ"},
                                                    {'ௌ', "ஒள"},
													{'்', "்"},
                                                    {'ஃ', "_ஃ"}
                                                     */
        };

        public static Dictionary<char, string> UyirEzuthukkal2LatinEnglishAgarathi = new Dictionary<char, string>
        {
                                                    {'அ', "_a"},
                                                    {'ஆ', "_A"},
                                                    {'இ', "_i"},
                                                    {'ஈ', "_I"},
                                                    {'உ', "_u"},
                                                    {'ஊ', "_U"},
                                                    {'எ', "_e"},
                                                    {'ஏ', "_E"},
                                                    {'ஐ', "_Y"},
                                                    {'ஒ', "_o"},
                                                    {'ஓ', "_O"},
                                                    {'ஔ', "_W"},
                                                    {'க', "k"},
                                                    {'ங', "G"},
                                                    {'ச', "c"},
                                                    {'ஞ', "J"},
                                                    {'ட', "T"},
                                                    {'ண', "N"},
                                                    {'த', "t"},
                                                    {'ந', "n"},
                                                    {'ப', "p"},
                                                    {'ம', "m"},
                                                    {'ய', "y"},
                                                    {'ர', "r"},
                                                    {'ல', "l"},
                                                    {'வ', "v"},
                                                    {'ழ', "Z"},
                                                    {'ள', "L"},
                                                    {'ற', "R"},
                                                    {'ன', "V"},
                                                    { 'ஜ', "J" },
                                                    { 'ஶ', "F" },
                                                    { 'ஷ', "S" },
                                                    { 'ஸ', "s" },
                                                    { 'ஹ', "h" },
                                                    {'ா', "A"}, // 0x0BBE - 'ா', ஆகார உயிர் மெய்யெழுத்தில் வரும் துணைக்கால் - கா
                                                    {'ி', "i"}, // 0x0BBF - 'ி', இகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கி
                                                    {'ீ', "I"}, // 0x0BC0 - 'ீ', ஈகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கீ
                                                    {'ு', "u"}, // 0x0BC1 - 'ு', உகார உயிர் மெய்யெழுத்தில் வரும் கீழே வரும் கோடு - பு
                                                    {'ூ', "U"}, // 0x0BC2 - 'ூ', ஊகார உயிர் மெய்யெழுத்தில் வரும் வளைந்த கொக்கி - பூ
                                                    {'ெ', "e"}, // 0x0BC6 - 'ெ', எகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கெ
                                                    {'ே', "E"}, // 0x0BC7 - 'ே', ஏகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கே
                                                    {'ை', "Y"}, // 0x0BC8 - 'ை' ஐகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கை
                                                    {'ொ', "o"}, // 0x0BCA - 'ொ', ஒகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கொ
                                                    {'ோ', "O"}, // 0x0BCB - 'ோ', ஓகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கோ
                                                    {'ௌ', "W"}, // 0x0BCC - 'ௌ', ஒளகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்புகள் - கெள
                                                    {'்', "X"}, // 0x0BCD - '்', ஒற்று எழுத்தில் தலையில் வரும் புள்ளி - க்
                                                    {'ஃ', "_K"} // 0X0B83 - 'ஃ', ஆய்த எழுத்து
        };
        public static Dictionary<char, char> AythaEzuthuAgarathi = new Dictionary<char, char>
        {
            { 'ஃ', 'ஃ' }
        };

        public static Dictionary<char, char> AgaraUyirMeyEzuthukkalAgarathi = new Dictionary<char, char>
        {
                                                    {'க', 'க'},
                                                    {'ங', 'ங'},
                                                    {'ச', 'ச'},
                                                    {'ஞ', 'ஞ'},
                                                    {'ட', 'ட'},
                                                    {'ண', 'ண'},
                                                    {'த', 'த'},
                                                    {'ந', 'ந'},
                                                    {'ப', 'ப'},
                                                    {'ம', 'ம'},
                                                    {'ய', 'ய'},
                                                    {'ர', 'ர'},
                                                    {'ல', 'ல'},
                                                    {'வ', 'வ'},
                                                    {'ழ', 'ழ'},
                                                    {'ள', 'ள'},
                                                    {'ற', 'ற'},
                                                    {'ன', 'ன'}
        };

        public static Dictionary<char, char> GranthaEzuthukkalAgarathi = new Dictionary<char, char>
        {
                                                    { 'ஜ', 'ஜ' },
                                                    { 'ஶ', 'ஶ' },
                                                    { 'ஷ', 'ஷ' },
                                                    { 'ஸ', 'ஸ' },
                                                    { 'ஹ', 'ஹ' },
        };

        public static Dictionary<int, int> UyirMeyKuriyeedugalAgarathi = new Dictionary<int, int>
        {
                { 0x0BCD, 0x0BCD }, // ஒற்று எழுத்தில் வரும் தலையில் வரும் புள்ளி - க்
                { 0x0BBE, 0x0BBE }, // ஆகார உயிர் மெய்யெழுத்தில் வரும் துணைக்கால் - கா
                { 0x0BBF, 0x0BBF }, // இகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கி
                { 0x0BC0, 0x0BC0 }, // ஈகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கீ
                { 0x0BC1, 0x0BC1 }, // உகார உயிர் மெய்யெழுத்தில் வரும் கீழே வரும் கோடு - பு
                { 0x0BC2, 0x0BC2 }, // ஊகார உயிர் மெய்யெழுத்தில் வரும் வளைந்த கொக்கி - பூ
                { 0x0BC6, 0x0BC6 }, // எகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கெ
                { 0x0BC7, 0x0BC7 }, // ஏகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கே
                { 0x0BC8, 0x0BC8 }, // ஐகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கை
                { 0x0BCA, 0x0BCA }, // ஒகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கொ
                { 0x0BCB, 0x0BCB }, // ஓகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கோ
                { 0x0BCC, 0x0BCC }  // ஒளகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்புகள் - கெள
        };
        public static List<string> UgaraMeiEzuthuVagaigal = new List<string>
        {
                                                "குடுமுருளுழு",
                                                "ஙுசுபுயுவு",
                                                "ஞுணுதுநுலுறுனு",
                                                "ஜுஸுஹு"
        };
        public static List<string> UugaraMeiEzuthuVagaigal = new List<string>
        {
                "டூமூரூளூழூ",
                "ஙூசூபூயூவூ",
                "ஞூணூதூநூலூறூனூ",
                "கூ",
                "ஜூஸூஹூ"
        };
        public static List<char> UyirEzuthukkal = new List<char> { 'அ', 'ஆ', 'இ', 'ஈ', 'உ', 'ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ' };
        public static List<string> UyirEzhuthukkalInLatin = new List<string>{ "_a", "_A", "_i", "_I", "_u", "_U", "_e", "_E", "_Y", "_o", "_O", "_W"};
        public static List<string> UyirEzhuthukkalInUyirMeiInLatin = new List<string> { "a", "A", "i", "I", "u", "U", "e", "E", "Y", "o", "O", "W" };
        public static List<char> UyirKurilEzuthukkal = new List<char> { 'அ', 'இ', 'உ', 'எ', 'ஒ' };
        public static List<char> UyirNedilEzuthukkal = new List<char> { 'ஆ', 'ஈ', 'ஊ', 'ஏ', 'ஐ', 'ஓ', 'ஔ' };
        public static List<char> AgaraUyirMeyEzuthukkal = new List<char> { 'க', 'ங', 'ச', 'ஞ', 'ட', 'ண', 'த', 'ந', 'ப', 'ம', 'ய', 'ர', 'ல', 'வ', 'ழ', 'ள', 'ற', 'ன' };
        public static List<string> MeyEzhuthukkalInLatin = new List<string> { "_k", "_G", "_c", "_J", "_T", "_N", "_t", "_n", "_p", "_m", "_y", "_r", "_l", "_v", "_Z", "_L", "_R", "_V", "_J", "_F", "_S", "_s", "_h" };
        public static List<string> AgaraUyirMeyEzhuthukkalInLatin = new List<string> { "k", "G", "c", "J", "T", "N", "t", "n", "p", "m", "y", "r", "l", "v", "Z", "L", "R", "V", "J", "F", "S", "s", "h" };
        public static List<char> GranthaEzuthukkal = new List<char> { 'ஜ', 'ஶ', 'ஷ', 'ஸ', 'ஹ' };

        public static List<string> VallinaKutriyalugaraEzhuthukal = new List<string>
            {"கு", "சு", "டு", "து", "பு", "று"};
        public static List<char> UyirMeyKurilEzuthukkal = new List<char>
        {
            /*'அ',  'இ',  'உ',  'எ',   'ஒ', */
            'ி', // 0x0BBF - இகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கி
            'ு', // 0x0BC1 - உகார உயிர் மெய்யெழுத்தில் வரும் கீழே வரும் கோடு - பு
            'ெ', // 0x0BC6 - எகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கெ
            'ொ'  // 0x0BCA - ஒகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கொ

        };
        public static List<char> UyirMeyNedilEzuthukkal = new List<char>
        {
            /*'ஆ', 'ஈ', 'ஊ', 'ஏ', 'ஐ', 'ஓ', 'ஔ', */
            'ா', // 0x0BBE - ஆகார உயிர் மெய்யெழுத்தில் வரும் துணைக்கால் - கா
            'ீ', // 0x0BC0 - ஈகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கீ
            'ூ', // 0x0BC2 - ஊகார உயிர் மெய்யெழுத்தில் வரும் வளைந்த கொக்கி - பூ
            'ே', // 0x0BC7 - ஏகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கே
            'ை', // 0x0BC8 - ஐகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கை,
            'ோ', // 0x0BCB - ஓகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கோ
            'ௌ'  // 0x0BCC - ஒளகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்புகள் - கெள
        };

        public static List<char> UyirMeyKuriyeedugal = new List<char>
        {
            '்', // 0x0BCD - ஒற்று எழுத்தில் வரும் தலையில் வரும் புள்ளி - க் ,
            'ா', // 0x0BBE - ஆகார உயிர் மெய்யெழுத்தில் வரும் துணைக்கால் - கா
            'ி', // 0x0BBF - இகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கி
            'ீ', // 0x0BC0 - ஈகார உயிர் மெய்யெழுத்தில் வரும் கொக்கி - கீ
            'ு', // 0x0BC1 - உகார உயிர் மெய்யெழுத்தில் வரும் கீழே வரும் கோடு - பு
            'ூ', // 0x0BC2 - ஊகார உயிர் மெய்யெழுத்தில் வரும் வளைந்த கொக்கி - பூ
            'ெ', // 0x0BC6 - எகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கெ
            'ே', // 0x0BC7 - ஏகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கே
            'ை', // 0x0BC8 - ஐகார உயிர் மெய்யெழுத்தில் இடது புறம் வரும் கொம்பு - கை
            'ொ', // 0x0BCA - ஒகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கொ
            'ோ', // 0x0BCB - ஓகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்பும் துணைக்காலும் - கோ
            'ௌ'  // 0x0BCC - ஒளகார உயிர் மெய்யெழுத்தில் இடது புறமும் வலது புறமும் வரும் கொம்புகள் - கெள
        };
        public static char AythaEzuthu = 'ஃ'; // 0X0B83 - 'ஃ', ஆய்த எழுத்து
        public static char MeyEzuthuPulli = '்'; // 0x0BCD - ஒற்று எழுத்தில் வரும் தலையில் வரும் புள்ளி - க்


        public static Dictionary<string, string> PunarchiPaguPadugal = new Dictionary<string, string>
            {
                {"00", "உயிர் முதல் உயிர் ஈறு"},
                {"01", "உயிர் முதல் மெய் ஈறு"},
                {"10", "மெய் முதல் உயிர் ஈறு"},
                {"11", "மெய் முதல் மெய் ஈறு"}
            };
    }
}
